---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.BadViewType
source: html/2d0e2178-8cda-e236-8d82-41cbee676112.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.BadViewType Property

Schedules can only be placed on Sheets.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadViewType { get; }
```